// Напиши код, який перевіряє, чи більше число a за число b.Виведи результат у консоль.
// let a = 5;
// let b = 12;
// console.log(a > b);

// Створи умову, яка перевіряє, чи число x менше або рівне числу y, і вивести результат.
// let x = 28;
// let y = 44;
// console.log(x <= y);

// Створи змінні a і b з довільними значеннями і порівняй їх на рівність за допомогою оператора ==. Виведи результат у консоль.
// let a = 25;
// let b = 25;
// console.log(a == b);

// let a = 25;
// let b = true;
// console.log(a == b);

// Перевір, чи є число m більше або рівне числу n, використовуючи оператор >=.
// let m = 2034;
// let n = 6895;
// console.log(m >= n);

// Створи умову, яка перевіряє, чи не дорівнює число x числу y, використовуючи оператор !=.
// let a = 39;
// let b = 34;
// console.log(a != b);

// Використовуючи оператори порівняння, перевір чи різні типи: число 5 і рядок "5" рівні за допомогою оператора ==.
// let a = 5;
// let b = "5";
// console.log(5 == "5");

// Перевір, чи число n є меншим за число m, використовуючи оператор <.
// let n = 546;
// let m = 4567;
// console.log(n < m);

// Напиши умову, яка перевіряє, чи є число a рівним числу b з точністю до типу даних (використовуй оператор ===).
// let a = 478;
// let b = 478;
// console.log(a === b);

// Перевір, чи число b більше або рівне числу a, використовуючи оператор >=.
// let a = 456;
// let b = 556;
// console.log(a >= b);

// Створи змінні first і second, обчисли їх суму та перевір, чи результат більше 10.
// let a = 345;
// let b = 245;
// let sum = a + b;
// console.log(sum);

// Напиши умовний оператор, який порівнює значення змінних num1 і num2. Якщо вони рівні — вивести "Рівні", інакше — "Не рівні".
// let num1 = 23;
// let num2 = 44;
// if (num1 === num2) {
//   console.log("Рівні");
// } else {
//   console.log("Не рівні");
// }

// Створи функцію, яка приймає два параметри і повертає "True", якщо їх різниця більше 10, інакше "False".
// let a = 124;
// let b = 453;
// if (a - b >= 10) {
//   console.log("True");
// } else {
//   console.log("False");
// }

// Порівняй два числа, x = 10 і y = "10". Перевір їх рівність з оператором == і з оператором ===.
// let x = 10;
// let y = "10";
// console.log(x == y);

// Використовуючи оператор порівняння, порівняй два значення: булеве значення true і число 1. Що поверне оператор ===?
// let x = true;
// let y = 1;
// console.log(x === y);

// Створи умову, яка перевіряє, чи число a менше або рівне числу b. Якщо так — вивести "Так", в іншому випадку — "Ні".
// let a = 12;
// let b = 13;
// if (a <= b) {
//   console.log("Так");
// } else {
//   console.log("Ні");
// }

// Напиши функцію, яка порівнює два числа та визначає, яке з них більше.
// let a = 22;
// let b = 33;
// function compareNumbers(a, b) {
//   if (a > b) {
//     console.log(a + " більше за " + b);
//   } else if (a < b) {
//     console.log(b + " більше за " + a);
//   } else {
//     console.log("Числа рівні");
//   }
// }
// compareNumbers(a, b);

// Створи програму, яка перевіряє, чи більше число m за 5, і виводить повідомлення, якщо це правда.
// let m = 7;
// if (m > 5) {
//   console.log(true);
// } else {
//   console.log(false);
// }

// Використовуючи оператори порівняння, порівняй два значення: рядок "apple" і рядок "Apple". Виведи результат у консоль.
// let a = "apple";
// let b = "Apple";
// console.log(a == b);

// Напиши код, який перевіряє, чи число x не дорівнює нулю.
// let x = 4;
// console.log(x !== 0);

// Створи програму, яка перевіряє, чи число n більше або дорівнює 100.
// let n = 20;
// console.log(n >= 100);

// Перевір, чи значення змінної age більше або дорівнює 18, і виведи в консоль, чи є користувач дорослим.
// let age = 22;
// if (age >= 18) {
//   console.log("Дорослий");
// }

// Напиши код, який порівнює два числа, перевіряючи, чи вони рівні, і виводить відповідне повідомлення "Рівні" чи "Не рівні".
// let a = 33;
// let b = 44;
// if (a === b) {
//   console.log("Рівні");
// } else {
//   console.log("Нерівні");
// }
